<!-- add-pr-comment:add-pr-comment -->

data.archive_file.func1: Reading...
data.archive_file.func1: Read complete after 0s [id=bcca341457150ea1f225830f2f6c84e37a39155a]
data.aws_acm_certificate.namabanana: Reading...
data.aws_acm_certificate.namabanana: Read complete after 0s [id=arn:aws:acm:us-east-1:958933161565:certificate/a435f1f9-6cf8-410c-be31-3eb3ee4180a9]
data.aws_iam_role.func1_role: Reading...
aws_cloudwatch_log_group.func1: Refreshing state... [id=/aws/lambda/send-mail-ses]
aws_api_gateway_rest_api.send_mail_api: Refreshing state... [id=jqi9ljoedk]
aws_cloudfront_function.index_document_function: Refreshing state... [id=index-document-function]
aws_s3_bucket.static_pages: Refreshing state... [id=note-app-static-pages]
aws_s3_bucket.send_mail_ses_src: Refreshing state... [id=send-mail-ses-src]
data.aws_iam_role.func1_role: Read complete after 1s [id=LambdaSESMailRole]
aws_api_gateway_resource.send_mail_api_resource: Refreshing state... [id=egrsqs]
aws_api_gateway_integration_response.options_response: Refreshing state... [id=agir-jqi9ljoedk-egrsqs-OPTIONS-200]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-jqi9ljoedk-egrsqs-OPTIONS-200]
aws_api_gateway_method.send_mail_api_get: Refreshing state... [id=agm-jqi9ljoedk-egrsqs-POST]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-jqi9ljoedk-egrsqs-OPTIONS]
aws_api_gateway_method_response.post_response: Refreshing state... [id=agmr-jqi9ljoedk-egrsqs-POST-200]
aws_s3_object.func1: Refreshing state... [id=send-mail-ses.zip]
aws_cloudfront_origin_access_control.note_app_oac: Refreshing state... [id=EP34N1TT7FO74]
aws_cloudfront_distribution.note_app_cfront: Refreshing state... [id=E35CO338AZ8MF7]
aws_lambda_function.func1: Refreshing state... [id=send-mail-ses]
data.aws_iam_policy_document.policy_document: Reading...
data.aws_iam_policy_document.policy_document: Read complete after 0s [id=3292064385]
aws_s3_bucket_policy.static_website: Refreshing state... [id=note-app-static-pages]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.send_mail_api_get: Refreshing state... [id=agi-jqi9ljoedk-egrsqs-POST]
aws_api_gateway_deployment.send_mail_api: Refreshing state... [id=0qck05]
aws_api_gateway_integration_response.post_response: Refreshing state... [id=agir-jqi9ljoedk-egrsqs-POST-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_object.func1 has been deleted
  - resource "aws_s3_object" "func1" {
        id                            = "send-mail-ses.zip"
      - key                           = "send-mail-ses.zip" -> null
        # (24 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.func1 will be updated in-place
  ~ resource "aws_lambda_function" "func1" {
        id                             = "send-mail-ses"
      ~ last_modified                  = "2025-06-22T13:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "jRQldKqPyKWxI5LpDZlQzlnOR2JLUsRpwO7NzJado8I=" -> "eB+5PYRoOjYWlhq/vvGBXIdOyUzgCCBSoNcwWwQsVkE="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.func1 will be created
  + resource "aws_s3_object" "func1" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "send-mail-ses-src"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "send-mail-ses.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../backend/api/send-mail-ses/send-mail-ses.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on apigateway.tf line 43, in resource "aws_api_gateway_deployment" "send_mail_api":
  43:     "aws_api_gateway_integration.send_mail_api_get",

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

Warning: Argument is deprecated

  with aws_api_gateway_deployment.send_mail_api,
  on apigateway.tf line 47, in resource "aws_api_gateway_deployment" "send_mail_api":
  47:   stage_name  = "v1"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
